[app]
UNKNOW_IMAGE=Invalid or unsupported image file format
SAVE_ERROR_FAIL=Save file fails
SAVE_ERROR_VIOLATION=Save file fails, other programs are using this file
SAVE_ERROR_NO_AUTHORITY=Save file fails, no permission to save in this directory
IDOK=OK
IDCANCEL=Cancel

[IDD_EFFECT_BRIGHTNESS]
1=Brightness
2=Contrast

[IDD_EFFECT_HUE]
1=Hue
2=Saturation

[IDD_EFFECT_COLOR_TONE]
1=Color
2=Saturation

[IDD_EFFECT_GLOW]
1=Soft
2=Brightness
3=Contrast

[IDD_EFFECT_SOFT_PORTRAIT]
1=Soft
2=Brightness
3=Warm

[IDD_EFFECT_ADJUSTRGB]
1=Red
2=Green
3=Blue

[IDD_EFFECT_GAMMA]
1=Gamma

[IDD_EFFECT_COLOR_LEVEL]
5=Input
6=Out
7=Channel :
10=RGB
11=R
12=G
13=B

[IDD_EFFECT_COLOR_BALANCE]
0=Cyan
1=Red
2=Magenta
3=Green
4=Yellow
5=Blue
10=Shadow
11=Midtone
12=Highlight
20=Preserve Luminosity

[IDD_EFFECT_MOSAIC]
1=Size

[IDD_EFFECT_SMOOTHEDGE]
1=Soft

[IDD_EFFECT_SHADOW]
0=Blur
1=Dark
2=Opacity
3=Offset

[IDD_EFFECT_BLUR]
1=Size

[IDD_EFFECT_BLURMOTION]
1=Speed
2=Angle

[IDD_EFFECT_BLURRADIAL]
1=Level

[IDD_EFFECT_BLURZOOM]
1=Level

[IDD_EFFECT_USM]
1=Radius
2=Amount
3=Threshold

[IDD_EFFECT_SHARP]
0=Lightly
1=Normal
2=Heavily
3=Level

[IDD_EFFECT_NOISIFY]
0=Amount
1=Color

[IDD_EFFECT_OILPAINT]
0=Size
1=Rough
2=Low
3=Mid
4=High

[IDD_EFFECT_EMBOSS]
0=Right
1=Top
2=Left
3=Bottom
4=Orientation

[IDD_EFFECT_SPLASH]
1=Level

[IDD_EFFECT_POSTERIZE]
1=Level

[IDD_EFFECT_TEXTURE]
0=Size
1=Opacity
10=Brick
11=Canvas 1
12=Canvas 2
13=Leather
14=Sandstone
15=Weave
16=Mat
17=Grid
18=Dot

[IDD_EFFECT_3DGRID]
1=Size
2=Depth
3=Large
4=Medium
5=Small
6=High
7=Medium
8=Low

[IDD_EFFECT_PENCILSKETCH]
1=Pen Size
2=Rough

[IDD_EFFECT_SHIFT]
1=Size

[IDD_EFFECT_RIBBON]
1=Amplitude
2=Frequency

[IDD_EFFECT_BULGE]
1=Level

[IDD_EFFECT_TWIST]
1=Twist
2=Size

[IDD_EFFECT_ILLUSION]
1=Amount

[IDD_EFFECT_WAVE]
1=Wavelength
2=Amplitude

[IDD_EFFECT_RIPPLE]
0=Length
1=Amount
2=Triangle
3=Sine

[IDD_EFFECT_LENSFLARE]
0=Click to set halo position

[IDD_EFFECT_SUPERNOVA]
0=Click to set halo position
1=Radius
2=Spokes

[IDD_EFFECT_GLASSTILE]
1=Size
2=Amount

[IDD_EFFECT_BLINDS]
0=Width
1=Opacity
2=Horizontal
3=Vertical

[IDD_EFFECT_RAISEFRAME]
1=Size

[IDD_EFFECT_THRESHOLD]
1=Level

[IDD_EFFECT_SOLARIZE]
1=Level

[IDD_EFFECT_OLDPHOTO]
1=Soft

[IDD_EFFECT_FILLGRID]
0=Size
1=Opacity

[IDD_EFFECT_VIDEO]
0=Type
1=Staggered
2=Triped
3=3 x 3
4=Dot

[IDD_EFFECT_CUSTOM]
1=Scale
2=Offset
3=Load
4=Save

[IDD_SAVE_IMAGE]
0=Windows Bitmap (*.bmp)|*.bmp|JPEG Image (*.jpg)|*.jpg|GIF Image (*.gif)|*.gif|PNG Image (*.png)|*.png|TIFF Image (*.tif)|*.tif||
1=32-bit ( with alpha )
2=Quality
3=Reserve EXIF
11= ( Worst )
12= ( Low )
13= ( Low )
14= ( Mid )
15= ( Mid )
16= ( Higher )
17= ( Higher )
18= ( High )
19= ( High )
20= ( Best )

[IDD_IMAGE_RESIZE]
1=Very large size , At least take %d Mb memory , Do you want to continue to create ?
2=Too large size , can't be created
5=Fixed Ratio
6=Ratio :
7=Ratio :
8=Width :
9=Height :
10=Pixel
30=Low
31=High
50=Quality

[MENU_TEXT]
s_3=&Effect
26018=Bright&ness / Contrast...
26019=&Hue / Saturation...
26040=Color &Tone...
26009=Black &White
26045=&Glow...
26066=Soft &Portrait...
s_2_0=&Color
26017=RGB &Value...
26020=&Gamma...
26038=Color &Level...
26044=Color &Balance...
26004=&Mosaic...
26003=&Negative
26039=&Auto Color Level
26048=Au&to Contrast
26050=Auto &Enhance
26026=&Size...\tF2
26000=&Flip
26001=&Mirror
26021=Rotate 90° C&lockwise
26023=Rotate 90° Counter-C&lockwise
26051=Soft &Edge...
26089=Add Sha&dow...
s_2_2=Bl&ur
26036=&Blur...
26052=&Despeckle
26037=&Motion Blur...
26029=&Zoom Blur...
26030=&Radial Blur...
s_2_3=Sha&rp
26042=&Sharp...
26043=&USM Sharp...
s_3_0=&Art
26053=&Noisy...
26012=&Oil Paint...
26002=&Emboss...
26008=&Splash...
26049=&Posterize...
26056=&Texture...
26058=3&D Grid...
26060=Pen&cil Sketch...
s_3_1=&Distort
26034=&Shift...
26015=&Ribbon...
26064=&Bulge...
26065=&Twist...
26035=&Illusion...
26046=&Wave...
26059=Ri&pple...
s_3_2=&Light
26062=&Lens Flare...
26063=&Sunshine...
26031=&Glass Tile...
26032=&Old Photo...
26055=&Blinds...
26057=3D &Frame...
s_3_3=&Color
26028=&Halftone
26010=&Threshold...
26013=&Solarize...
s_3_4=&Other
26054=Fill &Grid...
26061=&Video...
26047=Custom &Filter...
20236=Create &ASCII Painting...
26067=Draw &Text